yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/i2s_reg.h
 * |        |          |This bit field indicates the record destination base address of DMA.
 * @var I2S_T::PDESB2
 * Offset: 0x44  I2S Play DMA Destination Base Address 2 Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[31:0]  |AUDIO_PDESB2|32-bit Play Destination Base Address for Right Channel
 * |        |          |This bit field indicates the play destination base address of DMA.
 */
    __IO uint32_t GLBCON;                /*!< [0x0000] I2S Global Control Register                                      */
    __IO uint32_t RESET;                 /*!< [0x0004] I2S Sub Block Reset Control Register                             */
    __IO uint32_t RDESB;                 /*!< [0x0008] I2S Record DMA Destination Base Address Register                 */
    __IO uint32_t RDES_LENGTH;           /*!< [0x000c] I2S Record DMA Destination Length Register                       */
    __I  uint32_t RDESC;                 /*!< [0x0010] I2S Record DMA Destination Current Address Register              */
    __IO uint32_t PDESB;                 /*!< [0x0014] I2S Play DMA Destination Base Address Register                   */
    __IO uint32_t PDES_LENGTH;           /*!< [0x0018] I2S Play DMA Destination Length Register                         */
    __I  uint32_t PDESC;                 /*!< [0x001c] I2S Play DMA Destination Current Address Register                */
    __IO uint32_t RSR;                   /*!< [0x0020] I2S Record Status Register                                       */
    __IO uint32_t PSR;                   /*!< [0x0024] I2S Play Status Register                                         */
    __IO uint32_t CON;                   /*!< [0x0028] I2S Control Register                                             */
    __IO uint32_t COUNTER;               /*!< [0x002c] I2S Play DMA Down Counter Register                               */
    __IO uint32_t PCMCON;                /*!< [0x0030] I2S PCM Mode Control Register                                    */
    __IO uint32_t PCMS1ST;               /*!< [0x0034] I2S PCM Mode Slot 1 Start Register                               */
    __IO uint32_t PCMS2ST;               /*!< [0x0038] I2S PCM Mode Slot 2 Start Register                               */
    __I  uint32_t RESERVE0[1];
    __IO uint32_t RDESB2;                /*!< [0x0040] I2S Record DMA Destination Base Address 2 Register               */
    __IO uint32_t PDESB2;                /*!< [0x0044] I2S Play DMA Destination Base Address 2 Register                 */

} I2S_T;

/**
    @addtogroup I2S_CONST I2S Bit Field Definition
    Constant Definitions for I2S Controller
@{ */

#define I2S_GLBCON_BLOCK_EN_Pos          (0)                                               /*!< I2S_T::GLBCON: BLOCK_EN Position       */
#define I2S_GLBCON_BLOCK_EN_Msk          (0x3ul << I2S_GLBCON_BLOCK_EN_Pos)                /*!< I2S_T::GLBCON: BLOCK_EN Mask           */

#define I2S_GLBCON_IRQ_DMA_DATA_ZERO_EN_Pos (3)                                            /*!< I2S_T::GLBCON: IRQ_DMA_DATA_ZERO_EN Position*/
#define I2S_GLBCON_IRQ_DMA_DATA_ZERO_EN_Msk (0x1ul << I2S_GLBCON_IRQ_DMA_DATA_ZERO_EN_Pos) /*!< I2S_T::GLBCON: IRQ_DMA_DATA_ZERO_EN Mask*/

#define I2S_GLBCON_IRQ_DMA_CNTER_EN_Pos  (4)                                               /*!< I2S_T::GLBCON: IRQ_DMA_CNTER_EN Position*/
#define I2S_GLBCON_IRQ_DMA_CNTER_EN_Msk  (0x1ul << I2S_GLBCON_IRQ_DMA_CNTER_EN_Pos)        /*!< I2S_T::GLBCON: IRQ_DMA_CNTER_EN Mask   */

#define I2S_GLBCON_FIFO_TH_Pos           (7)                                               /*!< I2S_T::GLBCON: FIFO_TH Position        */
#define I2S_GLBCON_FIFO_TH_Msk           (0x1ul << I2S_GLBCON_FIFO_TH_Pos)                 /*!< I2S_T::GLBCON: FIFO_TH Mask            */

#define I2S_GLBCON_BITS_SELECT_Pos       (8)                                               /*!< I2S_T::GLBCON: BITS_SELECT Position    */
#define I2S_GLBCON_BITS_SELECT_Msk       (0x3ul << I2S_GLBCON_BITS_SELECT_Pos)             /*!< I2S_T::GLBCON: BITS_SELECT Mask        */

#define I2S_GLBCON_P_DMA_IRQ_Pos         (10)                                              /*!< I2S_T::GLBCON: P_DMA_IRQ Position      */
#define I2S_GLBCON_P_DMA_IRQ_Msk         (0x1ul << I2S_GLBCON_P_DMA_IRQ_Pos)               /*!< I2S_T::GLBCON: P_DMA_IRQ Mask          */

#define I2S_GLBCON_R_DMA_IRQ_Pos         (11)                                              /*!< I2S_T::GLBCON: R_DMA_IRQ Position      */
#define I2S_GLBCON_R_DMA_IRQ_Msk         (0x1ul << I2S_GLBCON_R_DMA_IRQ_Pos)               /*!< I2S_T::GLBCON: R_DMA_IRQ Mask          */

#define I2S_GLBCON_P_DMA_IRQ_SEL_Pos     (12)                                              /*!< I2S_T::GLBCON: P_DMA_IRQ_SEL Position  */
#define I2S_GLBCON_P_DMA_IRQ_SEL_Msk     (0x3ul << I2S_GLBCON_P_DMA_IRQ_SEL_Pos)           /*!< I2S_T::GLBCON: P_DMA_IRQ_SEL Mask      */

#define I2S_GLBCON_R_DMA_IRQ_SEL_Pos     (14)                                              /*!< I2S_T::GLBCON: R_DMA_IRQ_SEL Position  */
#define I2S_GLBCON_R_DMA_IRQ_SEL_Msk     (0x3ul << I2S_GLBCON_R_DMA_IRQ_SEL_Pos)           /*!< I2S_T::GLBCON: R_DMA_IRQ_SEL Mask      */

#define I2S_GLBCON_P_FIFO_EMPTY_IRQ_EN_Pos (16)                                            /*!< I2S_T::GLBCON: P_FIFO_EMPTY_IRQ_EN Position*/
#define I2S_GLBCON_P_FIFO_EMPTY_IRQ_EN_Msk (0x1ul << I2S_GLBCON_P_FIFO_EMPTY_IRQ_EN_Pos)   /*!< I2S_T::GLBCON: P_FIFO_EMPTY_IRQ_EN Mask*/

#define I2S_GLBCON_P_FIFO_FULL_IRQ_EN_Pos (17)                                             /*!< I2S_T::GLBCON: P_FIFO_FULL_IRQ_EN Position*/
#define I2S_GLBCON_P_FIFO_FULL_IRQ_EN_Msk (0x1ul << I2S_GLBCON_P_FIFO_FULL_IRQ_EN_Pos)     /*!< I2S_T::GLBCON: P_FIFO_FULL_IRQ_EN Mask */

#define I2S_GLBCON_R_FIFO_EMPTY_IRQ_EN_Pos (18)                                            /*!< I2S_T::GLBCON: R_FIFO_EMPTY_IRQ_EN Position*/
#define I2S_GLBCON_R_FIFO_EMPTY_IRQ_EN_Msk (0x1ul << I2S_GLBCON_R_FIFO_EMPTY_IRQ_EN_Pos)   /*!< I2S_T::GLBCON: R_FIFO_EMPTY_IRQ_EN Mask*/

#define I2S_GLBCON_R_FIFO_FULL_IRQ_EN_Pos (19)                                             /*!< I2S_T::GLBCON: R_FIFO_FULL_IRQ_EN Position*/
#define I2S_GLBCON_R_FIFO_FULL_IRQ_EN_Msk (0x1ul << I2S_GLBCON_R_FIFO_FULL_IRQ_EN_Pos)     /*!< I2S_T::GLBCON: R_FIFO_FULL_IRQ_EN Mask */

#define I2S_GLBCON_P_DMA_IRQ_EN_Pos      (20)                                              /*!< I2S_T::GLBCON: P_DMA_IRQ_EN Position   */
#define I2S_GLBCON_P_DMA_IRQ_EN_Msk      (0x1ul << I2S_GLBCON_P_DMA_IRQ_EN_Pos)            /*!< I2S_T::GLBCON: P_DMA_IRQ_EN Mask       */

