yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/i2s_reg.h
#define I2S_GLBCON_R_DMA_IRQ_EN_Pos      (21)                                              /*!< I2S_T::GLBCON: R_DMA_IRQ_EN Position   */
#define I2S_GLBCON_R_DMA_IRQ_EN_Msk      (0x1ul << I2S_GLBCON_R_DMA_IRQ_EN_Pos)            /*!< I2S_T::GLBCON: R_DMA_IRQ_EN Mask       */

#define I2S_RESET_BLOCK_RESET_Pos        (0)                                               /*!< I2S_T::RESET: BLOCK_RESET Position     */
#define I2S_RESET_BLOCK_RESET_Msk        (0x1ul << I2S_RESET_BLOCK_RESET_Pos)              /*!< I2S_T::RESET: BLOCK_RESET Mask         */

#define I2S_RESET_DMA_DATA_ZERO_EN_Pos   (3)                                               /*!< I2S_T::RESET: DMA_DATA_ZERO_EN Position*/
#define I2S_RESET_DMA_DATA_ZERO_EN_Msk   (0x1ul << I2S_RESET_DMA_DATA_ZERO_EN_Pos)         /*!< I2S_T::RESET: DMA_DATA_ZERO_EN Mask    */

#define I2S_RESET_DMA_CNTER_EN_Pos       (4)                                               /*!< I2S_T::RESET: DMA_CNTER_EN Position    */
#define I2S_RESET_DMA_CNTER_EN_Msk       (0x1ul << I2S_RESET_DMA_CNTER_EN_Pos)             /*!< I2S_T::RESET: DMA_CNTER_EN Mask        */

#define I2S_RESET_PLAY_Pos               (5)                                               /*!< I2S_T::RESET: PLAY Position            */
#define I2S_RESET_PLAY_Msk               (0x1ul << I2S_RESET_PLAY_Pos)                     /*!< I2S_T::RESET: PLAY Mask                */

#define I2S_RESET_RECORD_Pos             (6)                                               /*!< I2S_T::RESET: RECORD Position          */
#define I2S_RESET_RECORD_Msk             (0x1ul << I2S_RESET_RECORD_Pos)                   /*!< I2S_T::RESET: RECORD Mask              */

#define I2S_RESET_PLAY_SINGLE_Pos        (12)                                              /*!< I2S_T::RESET: PLAY_SINGLE Position     */
#define I2S_RESET_PLAY_SINGLE_Msk        (0x3ul << I2S_RESET_PLAY_SINGLE_Pos)              /*!< I2S_T::RESET: PLAY_SINGLE Mask         */

#define I2S_RESET_RECORD_SINGLE_Pos      (14)                                              /*!< I2S_T::RESET: RECORD_SINGLE Position   */
#define I2S_RESET_RECORD_SINGLE_Msk      (0x3ul << I2S_RESET_RECORD_SINGLE_Pos)            /*!< I2S_T::RESET: RECORD_SINGLE Mask       */

#define I2S_RESET_RESET_Pos              (16)                                              /*!< I2S_T::RESET: RESET Position           */
#define I2S_RESET_RESET_Msk              (0x1ul << I2S_RESET_RESET_Pos)                    /*!< I2S_T::RESET: RESET Mask               */

#define I2S_RESET_SPLIT_DATA_Pos         (20)                                              /*!< I2S_T::RESET: SPLIT_DATA Position      */
#define I2S_RESET_SPLIT_DATA_Msk         (0x1ul << I2S_RESET_SPLIT_DATA_Pos)               /*!< I2S_T::RESET: SPLIT_DATA Mask          */

#define I2S_RDESB_AUDIO_RDESB_Pos        (0)                                               /*!< I2S_T::RDESB: AUDIO_RDESB Position     */
#define I2S_RDESB_AUDIO_RDESB_Msk        (0xfffffffful << I2S_RDESB_AUDIO_RDESB_Pos)       /*!< I2S_T::RDESB: AUDIO_RDESB Mask         */

#define I2S_RDES_LENGTH_AUDIO_RDES_L_Pos (0)                                               /*!< I2S_T::RDES_LENGTH: AUDIO_RDES_L Position*/
#define I2S_RDES_LENGTH_AUDIO_RDES_L_Msk (0xfffffffful << I2S_RDES_LENGTH_AUDIO_RDES_L_Pos) /*!< I2S_T::RDES_LENGTH: AUDIO_RDES_L Mask  */

#define I2S_RDESC_AUDIO_RDESC_Pos        (0)                                               /*!< I2S_T::RDESC: AUDIO_RDESC Position     */
#define I2S_RDESC_AUDIO_RDESC_Msk        (0xfffffffful << I2S_RDESC_AUDIO_RDESC_Pos)       /*!< I2S_T::RDESC: AUDIO_RDESC Mask         */

#define I2S_PDESB_AUDIO_PDESB_Pos        (0)                                               /*!< I2S_T::PDESB: AUDIO_PDESB Position     */
#define I2S_PDESB_AUDIO_PDESB_Msk        (0xfffffffful << I2S_PDESB_AUDIO_PDESB_Pos)       /*!< I2S_T::PDESB: AUDIO_PDESB Mask         */

#define I2S_PDES_LENGTH_AUDIO_PDES_L_Pos (0)                                               /*!< I2S_T::PDES_LENGTH: AUDIO_PDES_L Position*/
#define I2S_PDES_LENGTH_AUDIO_PDES_L_Msk (0xfffffffful << I2S_PDES_LENGTH_AUDIO_PDES_L_Pos) /*!< I2S_T::PDES_LENGTH: AUDIO_PDES_L Mask  */

#define I2S_PDESC_AUDIO_PDESC_Pos        (0)                                               /*!< I2S_T::PDESC: AUDIO_PDESC Position     */
#define I2S_PDESC_AUDIO_PDESC_Msk        (0xfffffffful << I2S_PDESC_AUDIO_PDESC_Pos)       /*!< I2S_T::PDESC: AUDIO_PDESC Mask         */

#define I2S_RSR_R_DMA_RIA_IRQ_Pos        (0)                                               /*!< I2S_T::RSR: R_DMA_RIA_IRQ Position     */
#define I2S_RSR_R_DMA_RIA_IRQ_Msk        (0x1ul << I2S_RSR_R_DMA_RIA_IRQ_Pos)              /*!< I2S_T::RSR: R_DMA_RIA_IRQ Mask         */

#define I2S_RSR_R_FIFO_EMPTY_Pos         (1)                                               /*!< I2S_T::RSR: R_FIFO_EMPTY Position      */
#define I2S_RSR_R_FIFO_EMPTY_Msk         (0x1ul << I2S_RSR_R_FIFO_EMPTY_Pos)               /*!< I2S_T::RSR: R_FIFO_EMPTY Mask          */

#define I2S_RSR_R_FIFO_FULL_Pos          (2)                                               /*!< I2S_T::RSR: R_FIFO_FULL Position       */
#define I2S_RSR_R_FIFO_FULL_Msk          (0x1ul << I2S_RSR_R_FIFO_FULL_Pos)                /*!< I2S_T::RSR: R_FIFO_FULL Mask           */

#define I2S_RSR_R_DMA_RIA_SN_Pos         (5)                                               /*!< I2S_T::RSR: R_DMA_RIA_SN Position      */
#define I2S_RSR_R_DMA_RIA_SN_Msk         (0x7ul << I2S_RSR_R_DMA_RIA_SN_Pos)               /*!< I2S_T::RSR: R_DMA_RIA_SN Mask          */

#define I2S_PSR_P_DMA_RIA_IRQ_Pos        (0)                                               /*!< I2S_T::PSR: P_DMA_RIA_IRQ Position     */
#define I2S_PSR_P_DMA_RIA_IRQ_Msk        (0x1ul << I2S_PSR_P_DMA_RIA_IRQ_Pos)              /*!< I2S_T::PSR: P_DMA_RIA_IRQ Mask         */

#define I2S_PSR_P_FIFO_EMPTY_Pos         (1)                                               /*!< I2S_T::PSR: P_FIFO_EMPTY Position      */
#define I2S_PSR_P_FIFO_EMPTY_Msk         (0x1ul << I2S_PSR_P_FIFO_EMPTY_Pos)               /*!< I2S_T::PSR: P_FIFO_EMPTY Mask          */

#define I2S_PSR_P_FIFO_FULL_Pos          (2)                                               /*!< I2S_T::PSR: P_FIFO_FULL Position       */
#define I2S_PSR_P_FIFO_FULL_Msk          (0x1ul << I2S_PSR_P_FIFO_FULL_Pos)                /*!< I2S_T::PSR: P_FIFO_FULL Mask           */

#define I2S_PSR_DMA_DATA_ZERO_IRQ_Pos    (3)                                               /*!< I2S_T::PSR: DMA_DATA_ZERO_IRQ Position */
#define I2S_PSR_DMA_DATA_ZERO_IRQ_Msk    (0x1ul << I2S_PSR_DMA_DATA_ZERO_IRQ_Pos)          /*!< I2S_T::PSR: DMA_DATA_ZERO_IRQ Mask     */

#define I2S_PSR_DMA_CNTER_IRQ_Pos        (4)                                               /*!< I2S_T::PSR: DMA_CNTER_IRQ Position     */
#define I2S_PSR_DMA_CNTER_IRQ_Msk        (0x1ul << I2S_PSR_DMA_CNTER_IRQ_Pos)              /*!< I2S_T::PSR: DMA_CNTER_IRQ Mask         */

#define I2S_PSR_P_DMA_RIA_SN_Pos         (5)                                               /*!< I2S_T::PSR: P_DMA_RIA_SN Position      */
#define I2S_PSR_P_DMA_RIA_SN_Msk         (0x7ul << I2S_PSR_P_DMA_RIA_SN_Pos)               /*!< I2S_T::PSR: P_DMA_RIA_SN Mask          */

