yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/i2s_reg.h
#define I2S_CON_FORMAT_Pos               (3)                                               /*!< I2S_T::CON: FORMAT Position            */
#define I2S_CON_FORMAT_Msk               (0x1ul << I2S_CON_FORMAT_Pos)                     /*!< I2S_T::CON: FORMAT Mask                */

#define I2S_CON_MCLK_SEL_Pos             (4)                                               /*!< I2S_T::CON: MCLK_SEL Position          */
#define I2S_CON_MCLK_SEL_Msk             (0x1ul << I2S_CON_MCLK_SEL_Pos)                   /*!< I2S_T::CON: MCLK_SEL Mask              */

#define I2S_CON_BCLK_DIV_Pos             (5)                                               /*!< I2S_T::CON: BCLK_DIV Position          */
#define I2S_CON_BCLK_DIV_Msk             (0x7ul << I2S_CON_BCLK_DIV_Pos)                   /*!< I2S_T::CON: BCLK_DIV Mask              */

#define I2S_CON_PRS_Pos                  (16)                                              /*!< I2S_T::CON: PRS Position               */
#define I2S_CON_PRS_Msk                  (0xful << I2S_CON_PRS_Pos)                        /*!< I2S_T::CON: PRS Mask                   */

#define I2S_CON_SLAVE_Pos                (20)                                              /*!< I2S_T::CON: SLAVE Position             */
#define I2S_CON_SLAVE_Msk                (0x1ul << I2S_CON_SLAVE_Pos)                      /*!< I2S_T::CON: SLAVE Mask                 */

#define I2S_COUNTER_COUNTER_Pos          (0)                                               /*!< I2S_T::COUNTER: COUNTER Position       */
#define I2S_COUNTER_COUNTER_Msk          (0xfffffffful << I2S_COUNTER_COUNTER_Pos)         /*!< I2S_T::COUNTER: COUNTER Mask           */

#define I2S_PCMCON_BCLKP_Pos             (0)                                               /*!< I2S_T::PCMCON: BCLKP Position          */
#define I2S_PCMCON_BCLKP_Msk             (0x1ul << I2S_PCMCON_BCLKP_Pos)                   /*!< I2S_T::PCMCON: BCLKP Mask              */

#define I2S_PCMCON_PCM_PRS_Pos           (8)                                               /*!< I2S_T::PCMCON: PCM_PRS Position        */
#define I2S_PCMCON_PCM_PRS_Msk           (0xfful << I2S_PCMCON_PCM_PRS_Pos)                /*!< I2S_T::PCMCON: PCM_PRS Mask            */

#define I2S_PCMCON_FS_PERIOD_Pos         (16)                                              /*!< I2S_T::PCMCON: FS_PERIOD Position      */
#define I2S_PCMCON_FS_PERIOD_Msk         (0x3fful << I2S_PCMCON_FS_PERIOD_Pos)             /*!< I2S_T::PCMCON: FS_PERIOD Mask          */

#define I2S_PCMCON_PCM_MCLK_PRS_Pos      (28)                                              /*!< I2S_T::PCMCON: PCM_MCLK_PRS Position   */
#define I2S_PCMCON_PCM_MCLK_PRS_Msk      (0xful << I2S_PCMCON_PCM_MCLK_PRS_Pos)            /*!< I2S_T::PCMCON: PCM_MCLK_PRS Mask       */

#define I2S_PCMS1ST_SLOT1_I_START_Pos    (0)                                               /*!< I2S_T::PCMS1ST: SLOT1_I_START Position */
#define I2S_PCMS1ST_SLOT1_I_START_Msk    (0x3fful << I2S_PCMS1ST_SLOT1_I_START_Pos)        /*!< I2S_T::PCMS1ST: SLOT1_I_START Mask     */

#define I2S_PCMS1ST_SLOT1_O_START_Pos    (16)                                              /*!< I2S_T::PCMS1ST: SLOT1_O_START Position */
#define I2S_PCMS1ST_SLOT1_O_START_Msk    (0x3fful << I2S_PCMS1ST_SLOT1_O_START_Pos)        /*!< I2S_T::PCMS1ST: SLOT1_O_START Mask     */

#define I2S_PCMS2ST_SLOT2_I_START_Pos    (0)                                               /*!< I2S_T::PCMS2ST: SLOT2_I_START Position */
#define I2S_PCMS2ST_SLOT2_I_START_Msk    (0x3fful << I2S_PCMS2ST_SLOT2_I_START_Pos)        /*!< I2S_T::PCMS2ST: SLOT2_I_START Mask     */

#define I2S_PCMS2ST_SLOT2_O_START_Pos    (16)                                              /*!< I2S_T::PCMS2ST: SLOT2_O_START Position */
#define I2S_PCMS2ST_SLOT2_O_START_Msk    (0x3fful << I2S_PCMS2ST_SLOT2_O_START_Pos)        /*!< I2S_T::PCMS2ST: SLOT2_O_START Mask     */

#define I2S_RDESB2_AUDIO_RDESB2_Pos      (0)                                               /*!< I2S_T::RDESB2: AUDIO_RDESB2 Position   */
#define I2S_RDESB2_AUDIO_RDESB2_Msk      (0xfffffffful << I2S_RDESB2_AUDIO_RDESB2_Pos)     /*!< I2S_T::RDESB2: AUDIO_RDESB2 Mask       */

#define I2S_PDESB2_AUDIO_PDESB2_Pos      (0)                                               /*!< I2S_T::PDESB2: AUDIO_PDESB2 Position   */
#define I2S_PDESB2_AUDIO_PDESB2_Msk      (0xfffffffful << I2S_PDESB2_AUDIO_PDESB2_Pos)     /*!< I2S_T::PDESB2: AUDIO_PDESB2 Mask       */

/**@}*/ /* I2S_CONST */
/**@}*/ /* end of I2S register group */
/**@}*/ /* end of REGISTER group */

#if defined(__CC_ARM)
#pragma no_anon_unions
#endif

#endif /* __I2S_REG_H__ */
